app/Controllers/Home.php

SELECT *
FROM `productos`
ORDER BY `id_producto` DESC
---
    public function index(): string
    {
        $productos = $this->ProductModel->orderBy('id_producto','desc')->findall();