app/Controllers/ProductController.php

SELECT *
FROM `productos`
ORDER BY `id_producto` ASC
---
    public function index()
    {
        $productos = $this->ProductModel->orderBy('id_producto','desc')->findall();

SELECT *
FROM `productos`
WHERE `nombre_producto` LIKE '%lkmanbvfyguikl,m vhjkl, vcghbjnm,%' ESCAPE '!'
ORDER BY `id_producto` DESC
---
    public function search_index(){
        $buscar=$this->request->getGet('buscar');
        $productos = $this->ProductModel->orderBy('id_producto','desc')->like('nombre_producto', $buscar)->findall();